Repository: fulloflove/engine
Catalog: helpdesk/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Found issues
ru: Найденные запросы

source: Open issues
ru: Открытые запросы

source: Closed issues
ru: Закрытые запросы

source: Assigned to you
ru: Назначенные вам

source: Issue status is already set to:
ru: Запрос уже находится в статусе:

source: Issue must be formed to be closed
ru: Чтобы закрыть запрос, необходимо оформить данные для отчета

source: Issue status is changed. New status:
ru: Статус запроса изменен. Новый статус:

source: Your email address is incorrect
ru: Некорректный адрес электронной почты

source: Both fields cannot be empty
ru: Оба поля не могут быть пусты

source: Contracts must be set for issue to be closed
ru: Чтобы закрыть запрос, необходимо указать договор сопровождения

source: New issue
ru: Новый запрос
