// справочник соответствия OSM ID: DB ID
var regionIds = {
    253256:60,144764:3,147166:7,140337:8,112819:9,77677:61,83184:10,81997:11,145729:62,72197:12,77665:13,115106:14,72181:15,109876:63,147167:79,145730:57,85617:17,253252:19,145454:18,109879:65,103906:20,108083:66,81995:22,151233:23,109878:72,144763:24,115100:25,85963:26,108082:2,190090:1,140290:28,72223:29,176095:31,72169:32,151228:33,115114:69,72196:70,102269:34,51490:35,2099216:36,274048:68,72195:16,89331:37,140294:38,140292:39,77669:40,72224:41,72182:42,115135:43,151225:4,155262:44,145194:64,393980:67,115136:68,72639:81,85606:45,71950:46,72194:27,337422:30,72193:47,394235:48,79379:49,1574364:82,110032:71,81996:50,108081:5,72180:51,79374:73,2095259:21,140295:52,81993:53,145195:74,140291:54,115134:75,72192:55,151223:6,190911:76,140296:49,77687:56,109877:80,80513:77,151231:58,151234:78,191706:49,81994:59
};

var baseUrl = '/regions/';

var myMap;

ymaps.ready(initialize);

function initialize () {
    // инициализация параметров карты
    var mapOptions = {
    zoom: 5,
    center: [55.9116096,53.8046],
    controls: ["zoomControl"]
  };


    myMap = new ymaps.Map('ymap', mapOptions); // создание карты

    ymaps.regions.load('RU', {
        lang: 'ru',
        quality: 1
    }).then(function (result) {
        var regions = result.geoObjects; // ссылка на коллекцию GeoObjectCollection
        myMap.geoObjects.add(regions); // добавление регионов на карту

        // переход по клику на страницу региона
        result.geoObjects.events.add('click', function (e) {
            var region = e.get('target');
            var osmId = region.properties.get('osmId'); // получение OSM ID региона
            var regId = regionIds[osmId]; // получение соответствующего ID из справочника
            var url = baseUrl + regId; // конструирование URL
            window.location.href = url; // переход по URL
        });

        }, function () {
            alert('No response');
        });
}

